testing/soap/test_get_book_price.xml

<!-- ============================================================
     SOAP Test: getBookPrice – used in BPEL loop
     Q5/Q6: CatalogService SOAP test body
     Paste this into SOAP UI or send with curl (see below)

     curl command:
     curl -s -X POST http://localhost:8080/CatalogService/catalog ^
       -H "Content-Type: text/xml;charset=UTF-8" ^
       -H "SOAPAction: http://catalog.globalbooks.com/v1/getBookPrice" ^
       -d @test_get_book_price.xml
     ============================================================ -->
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:cat="http://catalog.globalbooks.com/types/v1"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">

    <soapenv:Header>
        <!-- WS-Security UsernameToken Q12 -->
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>catalog-client</wsse:Username>
                <wsse:Password>s3cur3P@ss</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>

    <soapenv:Body>
        <cat:getBookPriceRequest>
            <cat:bookId>B001</cat:bookId>
        </cat:getBookPriceRequest>
    </soapenv:Body>

</soapenv:Envelope>
