testing/soap/test_search_books.xml

<!-- ============================================================
     SOAP Test: searchBooks
     ============================================================ -->
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:cat="http://catalog.globalbooks.com/types/v1"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">

    <soapenv:Header>
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>catalog-client</wsse:Username>
                <wsse:Password>s3cur3P@ss</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>

    <soapenv:Body>
        <cat:searchBooksRequest>
            <cat:keyword>Architecture</cat:keyword>
        </cat:searchBooksRequest>
    </soapenv:Body>

</soapenv:Envelope>
